/*--------------------------------------------------------------------------------------

5.15答：（a）ix不等于sz执行循环体，循环体中应该有跳出循环的语句（break或return）来执行后面
	的if语句，不然if条件永远为假；（b）ix应该赋初值，当ix不等于sz的时候执行循环体；（c）当sz不
	等于0的时候循环变成一个无限循环或者说是一个死循环

----------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------

//5.16答：
const size_t sz = 10;
int a[sz];
size_t index = 0;

for (; index != sz; ++index)
{
	//操作元素
}

while (index != sz)
{
	//操作元素
	++index;
}

do{
	//操作元素
	++index;
} while (index != sz);
}//每种循环都有自己各自的特点。功能上都是等价的，根据自己的爱好或者程序的需要选择就行。

-------------------------------------------------------------------------------------*/