/*---------------------------------------------------------------------------------------------------------------


6.18答：（a）bool compare(matrix&, matrix&);
（b）vector<int>::iterator chang_val(int , vector<int>::iterator)

6.19答：（a）不合法，接收的参数个数；（b）合法；（c）合法；（d）合法；

6.20答：当引用形参不需要去修改实参值得时候应该用const，如果形参应该是常量引
	用而我们把它修改成普通引用，会产生意想不到的结果，比如修改了实参的值。

6.21答：int(int i , const int *p){return i > *p ? i : *p;}指针的类型是int*；


6.22答：void swapPtr（int **p1，int **p2）；



---------------------------------------------------------------------------------------------------------------------*/
